import { Data } from "../types/data";

const DATA:Data = [
  {    
    topic: 'Технологии',
    events: [
      {
        year: 1980,
        description: 'Sinclair Research выпускает домашний компьютер ZX80',
      },
      {
        year: 1982,
        description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        year: 1983,
        description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        year: 1984,
        description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        year: 1985,
        description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        year: 1986,
        description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      }
    ]
  },
  {    
    topic: 'Кино',
    events: [
      {
        year: 1987,
        description: '"Хищник"/Predator, США (реж. Джон Мактирнан)',
      },
      {
        year: 1988,
        description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        year: 1989,
        description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        year: 1990,
        description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        year: 1991,
        description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      }
    ]
  },
  {
    topic: 'Литература',
    events: [
      {
        year: 1992,
        description: 'Нобелевская премия по литературе - Дерек Уолкотт, "За блестящий образец карибского эпоса в 64 разделах".',
      },
      {
        year: 1994,
        description: '"Бессонница - роман Стивена Кинга."',
      },
      {
        year: 1995,
        description: 'Нобелевская премия ',
      },
      {
        year: 1997,
        description: 'Нобелевская премия ',
      }
    ]
  },
  {
    topic: 'Театр',
    events: [
      {
        year: 1999,
        description: 'Премьера балета "Золушка"',
      },
      {
        year: 2000,
        description: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
      },
      {
        year: 2002,
        description: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
      },
      {
        year: 2003,
        description: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
      },
      {
        year: 2004,
        description: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
      }
    ]
  },
  {
    topic: 'Спорт',
    events: [
      {
        year: 2008,
        description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        year: 2016,
        description: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
      },
      {
        year: 2017,
        description: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
      }
    ]
  },
  {
    topic: 'Наука',
    events: [
      {
        year: 2015,
        description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        year: 2016,
        description: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
      },
      {
        year: 2017,
        description: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
      },
      {
        year: 2018,
        description: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
      },
      {
        year: 2022,
        description: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
      }
    ]
  }
]

export default DATA;