import { Data } from "../types/data";

const DATA:Data = [
  {    
    topic: 'Технологии',
    events: [
      {
        year: 2015,
        description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        year: 2015,
        description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      }
    ]
  },
  {    
    topic: 'Кино',
    events: [
      {
        year: 2015,
        description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        year: 2015,
        description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      }
    ]
  },
  {
    topic: 'Литература',
    events: [
      {
        year: 1992,
        description: 'Нобелевская премия по литературе - Дерек Уолкотт, "За блестящий образец карибского эпоса в 64 разделах".',
      },
      {
        year: 1994,
        description: '"Бессонница - роман Стивена Кинга."',
      },
      {
        year: 1995,
        description: 'Нобелевская премия ',
      }
    ]
  },
  {
    events: [
      {
        year: 2015,
        description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        year: 2016,
        description: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
      },
      {
        year: 2017,
        description: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
      }
    ]
  },
  {
    topic: 'Спорт',
    events: [
      {
        year: 2015,
        description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        year: 2016,
        description: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
      },
      {
        year: 2017,
        description: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
      }
    ]
  },
  {
    topic: 'Наука',
    events: [
      {
        year: 2015,
        description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды',
      },
      {
        year: 2016,
        description: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11',
      },
      {
        year: 2017,
        description: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi',
      }
    ]
  }
]

export default DATA;